2021-05-05-cafe.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="http://dlqs.dev/rss.xml"
      title="RSS feed for http://dlqs.dev">
<title>Cafés</title>
<link rel="icon" href="data:,">
             <meta name="viewport" content="width=device-width, initial-scale=1.0"></head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">05 May 2021</div><h1 class="post-title"><a href="http://dlqs.dev/2021-05-05-cafe.html">Cafés</a></h1>
<p>
I go to cafes often and want to record down my experience, so that I can leave a trail of credible, organic reviews for these places.
So that reviews for these places aren't just dominated by professional bloggers' sites which are SEO-ed to death.
</p>

<p>
I rate these cafes commensurate with their prices. I don't expect single-origin coffee from the neighborhood
<i>kopi-tiam</i>, but I also believe that Starbucks coffee is way overpriced. Of course, the coffee merely forms part of the cafe experience among other factors,
such as the atmosphere and the food, so I try to keep those in mind too.
</p>

<p>
My scale is out of 5:
</p>
<ul class="org-ul">
<li>3 is at expectation,</li>
<li>2 and 4 are below and above respectively, and</li>
<li>1 and 5 are way below and way above respectively.</li>
</ul>

<div id="outline-container-org1ecea25" class="outline-2">
<h2 id="org1ecea25">Kurasu</h2>
<div class="outline-text-2" id="text-org1ecea25">
<ul class="org-ul">
<li>Visited in May 2021. Tried the Ethopian pour over. It's alright; nice clean taste, but not much else.</li>
<li>The cafe has a nice aesthetic, except that the outward view is kinda terrible due to ongoing construction outside.</li>
<li>3/5, since it was priced relatively higher at $8.</li>
</ul>
</div>
</div>

<div id="outline-container-org15e207d" class="outline-2">
<h2 id="org15e207d">Glasshouse</h2>
<div class="outline-text-2" id="text-org15e207d">
<ul class="org-ul">
<li>Visited in May 2021. I spotted Nylon beans, but I'm not sure which ones they used specifically.</li>
<li>Nice ambience, but CHIMES is just nice in general.</li>
<li>I had the long black for $5. Nothing particularly special.</li>
<li>3/5</li>
</ul>
</div>
</div>
<div class="taglist"><a href="http://dlqs.dev/tags.html">Tags</a>: <a href="http://dlqs.dev/tag-coffee.html">coffee</a> </div></div>
<div id="postamble" class="status"><p>Donald Lee Qian Siang</p>
            <div id="archive">
            <a href="https://dlqs.dev/archive.html">Archive</a>
            </div>
      </div>
</body>
</html>
